In [1]:
#python -m venv myenv
#myenv\Scripts\activate
print("Hellow World!")

Hellow World!

In [2]:
#pip install pandas numpy seaborn scikit-learn
import pandas as pd

In [7]:
#pip install kaggle
#kaggle datasets download -d (thedatset fro kaggle)
#to unzip
# Expand-Archive -Path churn-for-bank-customers.zip -DestinationPath data
df = pd.read_csv('churn.csv')
print(df.head())

   RowNumber  CustomerId   Surname  CreditScore Geography  Gender  Age  \
0          1    15634602  Hargrave          619    France  Female   42
1          2    15647311      Hill          608     Spain  Female   41
2          3    15619304      Onio          502    France  Female   42
3          4    15701354      Boni          699    France  Female   39
4          5    15737888  Mitchell          850     Spain  Female   43

   Tenure    Balance  NumOfProducts  HasCrCard  IsActiveMember  \
0       2       0.00              1          1               1
1       1   83807.86              1          0               1
2       8  159660.80              3          1               0
3       1       0.00              2          0               0
4       2  125510.82              1          1               1

   EstimatedSalary  Exited
0        101348.88       1
1        112542.58       0
2        113931.57       1
3         93826.63       0
4         79084.10       0

In [8]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           10000 non-null  object
 6   Age              10000 non-null  int64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.1+ MB
None

In [9]:
print(df.describe())

         RowNumber    CustomerId   CreditScore           Age        Tenure  \
count  10000.00000  1.000000e+04  10000.000000  10000.000000  10000.000000
mean    5000.50000  1.569094e+07    650.528800     38.921800      5.012800
std     2886.89568  7.193619e+04     96.653299     10.487806      2.892174
min        1.00000  1.556570e+07    350.000000     18.000000      0.000000
25%     2500.75000  1.562853e+07    584.000000     32.000000      3.000000
50%     5000.50000  1.569074e+07    652.000000     37.000000      5.000000
75%     7500.25000  1.575323e+07    718.000000     44.000000      7.000000
max    10000.00000  1.581569e+07    850.000000     92.000000     10.000000

             Balance  NumOfProducts    HasCrCard  IsActiveMember  \
count   10000.000000   10000.000000  10000.00000    10000.000000
mean    76485.889288       1.530200      0.70550        0.515100
std     62397.405202       0.581654      0.45584        0.499797
min         0.000000       1.000000      0.00000        0.000000
25%         0.000000       1.000000      0.00000        0.000000
50%     97198.540000       1.000000      1.00000        1.000000
75%    127644.240000       2.000000      1.00000        1.000000
max    250898.090000       4.000000      1.00000        1.000000

       EstimatedSalary        Exited
count     10000.000000  10000.000000
mean     100090.239881      0.203700
std       57510.492818      0.402769
min          11.580000      0.000000
25%       51002.110000      0.000000
50%      100193.915000      0.000000
75%      149388.247500      0.000000
max      199992.480000      1.000000

In [10]:
print(df.isnull().sum())

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [11]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [12]:
df.isnull().sum()

RowNumber          0
CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
Exited             0
dtype: int64

In [13]:
df = df.drop(columns=['RowNumber', 'Surname'])

In [14]:
df.head()

,CustomerId,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,15634602,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [15]:
df['Gender'] = df['Gender'].str.strip().str.lower()
df['Geography'] = df['Geography'].str.strip().str.title()

In [16]:
df.head()

,CustomerId,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,15634602,619,France,female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,female,43,2,125510.82,1,1,1,79084.10,0

In [17]:
#creating age groups
bins = [0, 25, 35, 45, 55, 75, 100] 
labels = ['18-24', '25-34', '35-44', '45-54', '55-74', '75+']
df['AgeGroup'] = pd.cut(df['Age'], bins=bins, labels=labels)

In [18]:
#cteaing credit score bands
bins_cs = [0, 500, 670, 740, 800, 900] 
labels_cs = ['Poor', 'Fair', 'Good', 'Very Good', 'Excellent']
df['CreditScoreGroup'] = pd.cut(df['CreditScore'], bins=bins_cs, labels=labels_cs)

In [21]:
df["HasBalance"] = df["Balance"].apply(lambda x: 1 if x > 0 else 0)

In [22]:
df.head()

,CustomerId,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,AgeGroup,CreditScoreGroup,HasBalance
0,15634602,619,France,female,42,2,0.00,1,1,1,101348.88,1,35-44,Fair,0
1,15647311,608,Spain,female,41,1,83807.86,1,0,1,112542.58,0,35-44,Fair,1
2,15619304,502,France,female,42,8,159660.80,3,1,0,113931.57,1,35-44,Fair,1
3,15701354,699,France,female,39,1,0.00,2,0,0,93826.63,0,35-44,Good,0
4,15737888,850,Spain,female,43,2,125510.82,1,1,1,79084.10,0,35-44,Excellent,1

In [23]:
df.duplicated().sum()

np.int64(0)

In [25]:
#pip install sqlalchemy psycopg2-binary
from sqlalchemy import create_engine
#psql connection
engine = create_engine("postgresql://postgres:Matthew286@localhost:5432/churn_db")

try:
    engine
    print("Connection Successed to PSQL")
except:
    print("Unable to connect")

Connection Successed to PSQL

In [26]:
df.to_sql(name='churn', con=engine, if_exists='append', index=False)

1000

In [27]:
df.to_csv('churn_cleaned.csv', index=False)